# =============================================================================
# Brewfile - Managed Package Configuration
# =============================================================================
#
# How to use:
# Run 'brew bundle' in the same folder as this file to install all packages.
#
# Sections:
# - Taps: External repositories
# - Command Line Tools: General utilities and CLI tools
# - Development Tools: Programming languages and development utilities
# - DevOps Tools: Infrastructure and deployment tools
# - Productivity Apps: Applications for daily work
# - Browsers: Web browsers
# - Communication: Chat and communication tools
# - Utilities: System utilities and helpers
# - Media & Entertainment: Media players and entertainment apps
# =============================================================================

# =============================================================================
# Taps - External repositories
# =============================================================================

tap 'amazeeio/lagoon-cli'           # Lagoon CLI repository
tap 'shivammathur/php'              # PHP version manager repository

# =============================================================================
# Command Line Tools - General utilities and CLI tools
# =============================================================================

brew 'eza'                          # A modern replacement for ls: https://eza.rocks/
brew 'git'                          # Distributed version control system
brew 'gpatch'                       # GNU patch for applying diffs to files
brew 'httpie'                       # User-friendly cURL replacement (HTTP client)
brew 'jq'                           # Command-line JSON processor
brew 'openssh'                      # OpenSSH remote login client
brew 'yq'                           # Command-line YAML processor

# =============================================================================
# Development Tools - Programming languages and development utilities
# =============================================================================

# PHP
brew 'shivammathur/php/php@8.3'     # PHP 8.3 interpreter
brew 'shivammathur/php/php@8.4'     # PHP 8.4 interpreter
#brew 'php'                          # Latest PHP version
#brew 'composer'                     # Dependency manager for PHP

# JavaScript/Node.js
brew 'nvm'                          # Node Version Manager
brew 'yarn'                         # JavaScript package manager

# Development Utilities
brew 'gh'                           # GitHub CLI tool
brew 'mkcert'                       # Tool for making locally-trusted certificates

# =============================================================================
# DevOps Tools - Infrastructure and deployment tools
# =============================================================================

brew 'amazeeio/lagoon-cli/lagoon'   # CLI for interacting with Lagoon API
brew 'ansible'                      # IT automation platform
brew 'doctl'                        # Command-line tool for DigitalOcean
brew 'opentofu'                     # Infrastructure as code tool (Terraform fork)
#brew 'aquasecurity/trivy/trivy'     # Vulnerability Scanner for containers

# =============================================================================
# Productivity Apps - Applications for daily work
# =============================================================================

cask 'iterm2'                       # Terminal emulator
cask 'phpstorm'                     # PHP IDE by JetBrains
cask 'beekeeper-studio'             # SQL client and database manager
cask 'bruno'                        # API client for testing and debugging
cask 'rectangle'                    # Window management tool
cask 'transmit'                     # File transfer client (FTP, SFTP, S3)
#cask 'sublime-text'                 # Sophisticated text editor

# =============================================================================
# Browsers - Web browsers
# =============================================================================

cask 'firefox'                      # Mozilla Firefox web browser
cask 'google-chrome'                # Google Chrome web browser

# =============================================================================
# Communication - Chat and communication tools
# =============================================================================

cask 'slack'                        # Team communication and collaboration

# =============================================================================
# Utilities - System utilities and helpers
# =============================================================================

cask '1password-cli'                # Command-line interface for 1Password
cask 'keepingyouawake'              # Prevents Mac from sleeping
cask 'orbstack'                     # Docker and Linux container manager
#cask 'istat-menus'                  # System monitoring tool
#cask 'tunnelblick'                  # OpenVPN client
#brew 'mackup'                       # Keep application settings in sync
#brew 'nss'                          # Network Security Services libraries

# =============================================================================
# Media & Entertainment - Media players and entertainment apps
# =============================================================================

#cask 'steam'                        # Gaming platform
#cask 'transmission'                 # BitTorrent client
