#
# How to use:
# Run 'brew bundle' in the same folder as this file.
#

# Binaries

tap 'amazeeio/lagoon-cli'

brew 'amazeeio/lagoon-cli/lagoon'   # Command line tool for interacting with a Lagoon API
brew 'ansible'                      # Automate deployment, configuration, and upgrading
brew 'doctl'                        # Command-line tool for DigitalOcean
brew 'eza'                          # A modern replacement for ls: https://eza.rocks/
brew 'gh'                           # Github CLI
brew 'git'                          # Git (replace the one from Apple)
brew 'httpie'                       # User-friendly cURL replacement (command-line HTTP client)
brew 'jq'                           #
brew 'mkcert'                       # Simple tool to make locally trusted development certificates
brew 'nvm'                          # Manage multiple Node.js versions
brew 'openssh'                      # Better SSH client
brew 'opentofu'                     # Tool to build, change, and version infrastructure
brew 'yarn'                         # JS package manager
brew 'gpatch'                       # GNU patch
brew 'yq'                           #

#brew 'aquasecurity/trivy/trivy'     # Vulnerability Scanner for Containers and other Artifacts, Suitable for CI.
#brew 'mackup'                       # Keep your Mac's application settings in sync
#brew 'nss'                          # Libraries for security-enabled client and server applications

# Development

tap 'shivammathur/php'
brew 'shivammathur/php/php@8.2'     # PHP 8.2
brew 'shivammathur/php/php@8.3'     # PHP 8.3
brew 'php'                          # PHP 8.4
brew 'composer'                     # Composer

# Apps

cask '1password-cli'                # 1password CLI
cask 'orbstack'                     # Orbstack Docker
cask 'firefox'                      # Firefox browser
cask 'google-chrome'                # Google Chrome Browser
#cask 'istat-menus'                  # iStats Menus 6
cask 'iterm2'                       # Terminal
cask 'keepingyouawake'              # KeepingYouAwake
cask 'phpstorm'                     # IDE
cask 'rectangle'                    # Move and resize windows in macOS using keyboard shortcuts or snap areas
cask 'beekeeper-studio'             # Beekeeper Studio
cask 'slack'                        # Slack chats
cask 'bruno'                        # API client
cask 'transmit'                     # File transfer app
#cask 'sublime-text'                 # Text editor
#cask 'tunnelblick'                  # VPN for Helsinki University

# Additional apps

#cask 'steam'                        # Steam
#cask 'transmission'                 # Torrent client
