#
# How to use:
# Run 'brew bundle' in the same folder as this file.
#

# Taps

tap 'amazeeio/lagoon-cli'
tap 'drud/ddev'

# Binaries

brew 'amazeeio/lagoon-cli/lagoon'   # Command line tool for interacting with a Lagoon API
brew 'ansible'                      # Automate deployment, configuration, and upgrading
brew 'doctl'                        # Command-line tool for DigitalOcean
brew 'drud/ddev/ddev'               # ddev: a local development environment management system
brew 'httpie'                       # User-friendly cURL replacement (command-line HTTP client)
brew 'lastpass-cli'                 # LastPass command-line interface tool
brew 'mackup'                       # Keep your Mac's application settings in sync
brew 'mas'                          # Mac App Store manager
brew 'mkcert'                       # Simple tool to make locally trusted development certificates
brew 'mysql'                        # MySQL
brew 'nss'                          # Libraries for security-enabled client and server applications
brew 'nvm'                          # Manage multiple Node.js versions
brew 'openshift-cli'                # OpenShift command-line interface tools
brew 'terraform'                    # Tool to build, change, and version infrastructure

# Development

brew 'php'                          # PHP 7.4
brew 'ruby'                         # Ruby

# Apps

cask 'docker'                       # Docker Desktop
cask 'firefox'                      # Firefox browser
cask 'google-chrome'                # Google Chrome Browser
cask 'istat-menus'                  # iStats Menus 6
cask 'iterm2'                       # Terminal
cask 'keepingyouawake'              # KeepingYouAwake
cask 'microsoft-teams'              # Microsoft Teams
cask 'notion'                       # Notion.so
cask 'phpstorm'                     # IDE
cask 'rectangle'                    # Move and resize windows in macOS using keyboard shortcuts or snap areas
cask 'screen'                       # Screen.so
cask 'slack'                        # Slack chats
cask 'steam'                        # Steam
cask 'sublime-text'                 # Text editor
cask 'transmission'                 # Torrent client
cask 'tunnelblick'                  # VPN for Helsinki University
cask 'vlc'                          # Video player
cask 'vyprvpn'                      # Druid VPN

# Mac App Store

mas 'LastPass Password Manager', id: 926036361
